Revit 2026 API

# ExternalResourceLoadContentVersion Property

---

The version of the external data that the server is providing in this object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Version { get; set; }
```
```vb
Public Property Version As String
	Get
	Set
```
```cpp
public:
property String^ Version {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Version : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When its LoadResource() method is invoked, an IExternalResourceServer can indicate the version of the data that it is providing to Revit by setting this property. Doing so will improve performance, because Revit will use the version information to avoid unnecessary reloads.

See GetResourceVersionStatus(ExternalResourceReference).

#### Reference

ExternalResourceLoadContent Class

Autodesk.Revit.DB Namespace